RhinoInside.Revit API Documentation
GeometryDecoder.ToPolylineCurve Method
 Converts the specified PolyLine to an equivalent Rhino PolylineCurve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8018
Syntax
public static Rhino.Geometry.PolylineCurve ToPolylineCurve(
	this Autodesk.Revit.DB.PolyLine value
)
Parameters
value
Type: Autodesk.Revit.DB.PolyLine
A value to convert.
Return Value
Type: Rhino.Geometry.PolylineCurve
A Rhino PolylineCurve that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.PolyLine. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace